[
  "Zelensky’s refusal to sign away nearly half of his country’s rare earth minerals for few guarantees is one of many reasons why Trump is raging at his Kyiv counterpart",
  "Europe’s closest ally is in bed with its worst enemy. Now what?",
  "US resisting including reference to ‘Russian aggression’ in G7 Ukraine anniversary statement",
  "As Trump loses patience with Ukraine, Russia’s biggest backer sees a ‘window for peace’",
  "Inside the 48 hours when Trump turned on Zelensky",
  "As Trump seeks a deal with Putin, will Western companies return to Russia?",
  "Russians talk to CNN about Trump and Zelensky",
  "GOP lawmaker warns that Putin is a ‘cancer’ in fiery speech",
  "Fareed Zakaria: Russian demands involving NATO troops reveal Putin’s aims",
  "Israel says Shiri Bibas is not among bodies returned from Gaza, vows revenge on Hamas",
  "It’s a make-or-break moment for Germany’s economy",
  "Trump wants to reclaim the Panama Canal. He’d be taking on a waterway facing crisis",
  "Catch up on today’s global news",
  "Singer Chantal Kreviazuk changes lyrics of Canadian anthem at hockey game to protest Trump’s 51st state remarks",
  "The ‘James Bond’ property is changing hands. Here’s who we’d love to see play 007 next",
  "This country has just 5.8 people per square mile — which is why it’s perfect for stargazing",
  "New Zealand’s bug of the year is an ancient worm that spits poison",
  "‘Insurance just keeps getting worse’: Doctor’s video goes viral",
  "George Clooney is farming and driving a tractor. Seriously",
  "Trump is one month in and Americans are already mad at him about inflation",
  "President Trump is angry over delays to Air Force One. It could spell even more trouble for Boeing",
  "Senate GOP adopts budget blueprint to advance Trump agenda, setting up clash with House Republicans",
  "Sweden investigates suspected sabotage of Baltic Sea telecoms cable",
  "Commercial airlines warned as Chinese navy holds live fire exercise off Australia",
  "‘MAGA is profoundly corrupt’: Ex-NFL player arrested at city meeting",
  "Breathtaking images from the Underwater Photographer of the Year contest",
  "A life-threatening blood clot sidelined NBA All-Star Victor Wembanyama. Here’s what to know",
  "This part of your workout routine could be a sign of a mental health problem, study suggests",
  "Netanyahu orders West Bank military operation after Israel bus blasts",
  "Arab leaders to gather for postwar Gaza proposal to counter Trump’s ‘Riviera’ plan",
  "Kash Patel, a staunch Trump loyalist, confirmed as FBI director",
  "Chunk of ice crashes through trucker’s windshield",
  "Target is in the right’s legal crosshairs over DEI again",
  "More than 170 Venezuelan migrants deported to Guantanamo arrive home",
  "Mexico’s Sheinbaum vows to protect national sovereignty as US cracks down on cartels",
  "Elon Musk wields chainsaw during CPAC appearance",
  "Why a 1,000-year-old masterpiece is about to vanish from view",
  "Can sandals be art? Birkenstock says yes, but a German court says no",
  "Many birds-of-paradise species can emit light, new research reveals",
  "Can a budget phone help Apple overtake Huawei in China?",
  "Canada beats the US in overtime thriller to win hockey’s first-ever 4 Nations Face-off championship",
  "Ex-Spanish soccer boss Rubiales found guilty of sexual assault on player",
  "Video shows cars frozen in ice after water main break floods Detroit neighborhood",
  "NASA strikes deal over layoffs of recent hires",
  "Astronomers spot flares of light near the black hole at the center of our galaxy",
  "Scientists developed a new method for the perfect boiled egg, and you can test it at home",
  "Largest celestial object of its kind discovered in the distant universe",
  "This new plane could open a flood of new transatlantic flights",
  "Why tourists are being told to wipe their shoes before visiting the ‘world’s clearest lake’",
  "China hopes new fleet of ‘silver trains’ will encourage its elderly to travel, and spend, more",
  "Travelers claim this TikTok seatbelt hack makes it easier to sleep on the plane. Experts say it’s ‘extremely dangerous’",
  "Can China turn its sinking foreign investments around?",
  "HSBC to save $1.8 billion over two years under new CEO",
  "Amazon workers at North Carolina warehouse vote against unionizing",
  "The American shopping mall is being reinvented",
  "Paris Hilton sells Y2K wardrobe in aid of LA wildfires",
  "Forgotten 19th-century Black potters get a second chance at representation",
  "Look of the Week: Emma Stone’s latest dress is made for sneaking snacks into the movies",
  "A father and son, photographed over 20 years",
  "MLB’s Spring Training games get underway in earnest on Friday. Here are 5 things to watch as baseball returns",
  "ESPN and MLB to end their decades-long relationship after 2025 season",
  "Milwaukee Bucks forward Bobby Portis Jr. banned for 25 games after testing positive for Tramadol",
  "Venus Williams, 44, handed wild card to play at Indian Wells",
  "Mac McClung makes Slam Dunk contest history during All-Star weekend",
  "Trump’s approval rating higher than it’s ever been, but warning signs it could be fleeting",
  "CNN finds high performers fired by DOGE in purge of federal workforce",
  "NASA strikes deal over layoffs of recent hires, says job cuts will be ‘performance-based or voluntary’",
  "Trump’s admin is reversing Biden policies everywhere. But it’s keeping this one",
  "Narcissists are significantly more likely to feel excluded, new study finds",
  "More Americans identify as LGBTQ+ than ever before, poll finds",
  "If you’re constantly tired, these health conditions could be the reasons why, experts say",
  "Pope Francis in hospital: How to reduce the chances of contracting pneumonia and other respiratory infections",
  "In from the cold? Alibaba co-founder Jack Ma spotted among top tech bosses who met China’s Xi",
  "OpenAI board rejects Elon Musk-led $97 billion purchase offer",
  "Meta keeps trying to invent the future. It hasn’t worked yet",
  "The real reason behind the DeepSeek hype, according to AI experts",
  "Northern hairy-nosed wombat: Back from the brink",
  "In pictures: The 149th Westminster Kennel Club Dog Show",
  "People we’ve lost in 2025",
  "Northern bald ibis: Back from the brink",
  "Alien species wreaking havoc around the world",
  "Stunning photographs capture starling migrations",
  "Fighting in Africa’s mineral-rich DRC killed over 3,000 in less than 2 weeks. Here’s how your phone plays a part",
  "Who is Friedrich Merz, Merkel’s rival and German election frontrunner?",
  "As Georgia slides into authoritarianism, protesters vow to keep fighting Russian pivot",
  "Suspect in Brazil Christmas cake poisonings found dead in prison cell",
  "Vance turns on European allies in blistering speech that downplayed threats from Russia and China",
  "The secret to great sex isn’t really a secret. It’s asking the right question, 81-year-old sex professor says",
  "How much coffee is too much, according to a doctor",
  "China hopes new fleet of ‘silver trains’ will encourage its elderly to travel, and spend, more",
  "No doctors for sick children. This is the reality of Trump’s aid freeze in remote northern Thailand",
  "More than 170 Venezuelan migrants deported to Guantanamo arrive home",
  "Mexico’s Sheinbaum vows to protect national sovereignty as US cracks down on cartels in its territory",
  "A conservationist is building bridges in the Amazon so monkeys can cross the road",
  "Building bridges to protect Brazilian primates",
  "The moment 80 lives were upended – literally – and tragedy was averted during the fiery crash of a Delta flight in Toronto",
  "Shark attacked tourist as she tried to take its picture in Turks and Caicos, authorities say",
  "Emergency teams respond to Delta plane crash at Toronto Pearson Airport",
  "Mexican singer-songwriter Paquita la del Barrio dies at 77",
  "Suspect in Brazil Christmas cake poisonings found dead in prison cell",
  "Humpback whale swallows and spits out kayaker in incident captured on camera",
  "Shuttered job school shows impact of Trump’s US aid halt, more than 2,400 miles away",
  "Mexico’s president and the art of keeping a ‘cool head’ with Trump",
  "Ecuador heads to run-off election between incumbent and leftist candidate",
  "Tsunami advisory canceled for Puerto Rico and Virgin Islands after magnitude-7.6 earthquake in the Caribbean",
  "Ecuador votes for a new president after years of violence and blackouts",
  "Trump’s threat to annex Canada ‘a real thing,’ Trudeau tells business leaders",
  "Two killed as small plane crashes into bus on busy road in Brazilian city of São Paulo",
  "Small plane crashes onto busy street in Brazil, colliding with bus",
  "Argentina says it will pull out of World Health Organization, mirroring Trump’s move last month",
  "This firm employs thousands in Canada, the US and Mexico. Here’s what its workers think of Trump’s tariffs",
  "El Salvador offers to house violent US criminals and deportees of any nationality in unprecedented deal",
  "Ecuador announces 27% tariffs on Mexican goods",
  "Man hailed as world’s first imam to say he was gay is shot dead in South Africa",
  "Rebels seen in center of key DR Congo city after claiming takeover",
  "White South Africans gather in support of Trump and his claims that they are victims of racism",
  "Paramilitary forces raid Sudan’s largest refugee camp",
  "Two mass graves with bodies of nearly 50 migrants found in southeastern Libya",
  "Trump freezes aid to South Africa over controversial land law, claiming discrimination against White farmers",
  "Eastern and Southern African leaders hold unprecedented summit to seek way out of Congo conflict",
  "More than 150 female inmates raped and burned to death during Goma jailbreak in DRC, UN says",
  "Nearly 3,000 people killed after rebels seize key city in DR Congo, UN says",
  "Fighting in Africa’s mineral-rich DRC killed over 3,000 in less than 2 weeks. Here’s how your phone plays a part",
  "South Africa does have a history of racist land inequality. Just not in the way Trump and Musk are portraying",
  "Violence erupts in mineral-rich DR Congo as rebels move into key city. Here’s what we know",
  "Across Africa, Russia is growing in influence. What might Moscow want?",
  "Genocide is declared once more in Sudan. How did the country get here?",
  "A price too high to pay? Pollution from Ghana’s gold rush sparks maternal health fears",
  "‘The world doesn’t see us:’ What a militia chief said while holding me captive in Darfur",
  "Millions have escaped Sudan’s civil war. But their nightmare isn’t over",
  "‘The hostility was something I’d never experienced before’: The cost to women of the overlooked rise of Kenya’s manosphere",
  "EVs are starting to overtake gas-powered cars in a surprising place",
  "African cities sitting on ‘keg of gunpowder’ as  growing youth anger fuels unrest",
  "The British Army trains in Kenya. Many women say soldiers raped them and abandoned children they fathered",
  "How Nigerian singer Patoranking and a British army vet are driving change through philanthropy",
  "‘I wanted to communicate’: Grammy-nominated Yemi Alade embraces multiple languages and genres to showcase Africa to the world",
  "Meet two African fashion brands that shine globally",
  "Actor Djimon Hounsou sparks Pan-African unity through nonprofit",
  "Celebrating 15 years of African Voices",
  "She was a teenage mother in Detroit. Now she’s a Ghanaian ‘Queen’",
  "How Bongo Flava Icon Alikiba and Ghanaian rapper Kofi Kinaata are using their star power to make a difference",
  "Yemi Alade reflects on her career and recent grammy nomination",
  "At over $10,000 per kilogram, Africa’s first caviar is surprising the luxury food industry",
  "How Nigeria’s biggest city became the world’s hottest winter party destination",
  "This alien plant is lethal for the environment. Now it’s being turned into a plastic to regrow forests",
  "How giant rodents could rat on wildlife traffickers",
  "The gigantic dunes rising up out of the world’s oldest desert",
  "Hydrogen-powered skyscraper set for Egypt’s new capital",
  "How African designers are making their mark on global fashion",
  "The $1 billion ‘electricity highway’ that allows Ethiopia and Kenya to share their power",
  "Boosting food production in Africa through tech",
  "‘We don’t want to leave anyone behind,’ says Google’s Alex Okosi on the company’s drive to cut data costs in Africa",
  "Solar-charging backpacks are helping children to read after dark",
  "How Mobihealth is driving a telemedicine revolution in Africa",
  "Chowdeck is hungry for Nigeria’s food delivery market. One day, it wants to be a ‘super-app for Africa’",
  "This Nigerian company wants to be the Airbnb of car rentals",
  "This Nigerian designer is making waves with her ‘four-dimensional’ fashion",
  "Barry Jenkins on why ‘Mufasa’ contains the ‘voice of Africa’",
  "‘Ernest Cole: Lost and Found’: The anti-apartheid photographer who turned his lens on Black America",
  "Art historian and curator Alayo Akinkugbe on reframing Blackness",
  "What’s driving the rapid growth of these African stock exchanges?",
  "South African president and Elon Musk discuss ‘misinformation’ after Trump aid threat",
  "Rebels call for ceasefire in DR Congo after hundreds are killed in a week of fighting",
  "Rwanda’s president says he doesn’t know if his country’s troops are in DRC",
  "South Africa denies ‘confiscating land,’ after Trump threatens to cut off aid",
  "Trump confirms on social media he authorized airstrikes on Somalia",
  "Paramilitary group attacks an open market in Sudan, killing 54 people and wounding at least 158",
  "UN says more than 700 killed in just five days of fighting in DR Congo",
  "Tourist trampled to death by elephant while reportedly trying to save his grandchild at South Africa park",
  "DR Congo’s president says country won’t be humiliated after rebels claim takeover",
  "Residents of Congo’s besieged city live in fear as government forces battle rebel takeover",
  "20 killed in South Sudan plane crash, officials say",
  "Italian prime minister says she is being investigated for repatriating a Libyan warlord",
  "Trump fired the latest tariff shot at China. Is Beijing prepared to make it a trade war?",
  "Teenage girl killed in shark attack while swimming at Australia tourist spot",
  "Taiwanese actor Barbie Hsu dies of flu-related illness at age 48",
  "In public, they ran a successful global business. In private, police allege they abused hundreds of children",
  "Australia braces for more destruction as deadly floods devastate northeast",
  "This snowy Japanese town represents love. But overtourism is turning the sweetness sour",
  "‘Indiscriminate madness’: DOGE claims firings target low performers and new employees. The reality is far from it",
  "Birds-of-paradise are sending secret color signals invisible to human eyes, scientists say",
  "France’s Bayeux Tapestry to close to public for two years",
  "As Trump seeks a deal with Putin, will Western companies return to Russia?",
  "Inside the 48 hours that Trump turned on Zelensky",
  "How churches are trying to keep their congregations safe as threats of ICE raids loom",
  "Venus Williams, 44, handed wild card to play at Indian Wells",
  "South Korea’s Yoon attends first trial hearing for insurrection",
  "Analysis: Trump’s 13 biggest lies of his first month back in office",
  "China’s foreign investment sank in January. Can Beijing turn things around?",
  "‘Breathtaking reversal in US foreign policy’: Fareed Zakaria reacts to Trump’s attacks on Zelensky",
  "CNN gets sneak peek of twin panda cubs in Hong Kong",
  "Trump says he doesn’t know why Musk met with India’s PM",
  "From the mountains to the desert: Where the ‘White Lotus’ cast would love the next season to be filmed",
  "Aid workers in Thailand laid off after USAID cuts",
  "‘My survival was to ask questions’: How a journalist investigated her own sexual assault",
  "Macron promises to ‘fight for AI’",
  "Ed Sheeran street performance shut down by police in India",
  "Commercial airlines warned as Chinese navy holds live fire exercise off Australia",
  "Can a budget phone help Apple overtake Huawei in China?",
  "As Trump loses patience with Ukraine, Russia’s biggest backer sees a ‘window for peace’"
]